Revit 2024 API
SharedParameterApplicableRule.ParameterName Property
 The name of the parameter that an element must support to pass this rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public string ParameterName { get; set; }
Visual Basic
Public Property ParameterName As String
	Get
	Set
Visual C++
public:
property String^ ParameterName {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
SharedParameterApplicableRule Class
Autodesk.Revit.DB Namespace